Repository: synysterkay/thesis
Catalog: lib/l10n/app_*.arb
Languages: es, fr, hi, zh

# welcome
source: Academic Writing Assistant
es: Tesis Académica Profesional
fr: Thèse Académique Professionnelle
hi: पेशेवर शैक्षणिक थीसिस
zh: 专业学术论文

# onboardDescription1
source: Learn to develop professional academic thesis structure
es: Crea tesis académicas profesionales con asistencia de IA
fr: Créez des thèses académiques professionnelles avec l'assistance de l'IA
hi: AI सहायता से पेशेवर शैक्षणिक थीसिस बनाएं
zh: 使用AI辅助创建专业学术论文

# smartContent
source: Smart Learning Framework
es: Generación Inteligente de Contenido
fr: Génération Intelligente de Contenu
hi: स्मार्ट सामग्री निर्माण
zh: 智能内容生成

# onboardDescription2
source: Practice organizing chapters and content effectively
es: Genera capítulos y contenido bien estructurados automáticamente
fr: Générez automatiquement des chapitres et du contenu bien structurés
hi: स्वचालित रूप से सुव्यवस्थित अध्याय और सामग्री तैयार करें
zh: 自动生成结构完善的章节和内容

# onboardDescription3
source: Export your learning materials in professional PDF format
es: Exporta tu tesis en formato PDF profesional
fr: Exportez votre thèse au format PDF professionnel
hi: अपनी थीसिस को पेशेवर PDF प्रारूप में निर्यात करें
zh: 以专业PDF格式导出论文

# easyExport
source: Easy Export In PDF
es: Exportación Fácil en PDF
fr: Exportation Facile en PDF
hi: PDF में आसान निर्यात
zh: 轻松PDF导出

source: Next
es: Siguiente
fr: Suivant
hi: अगला
zh: 下一步

# getStarted
source: Start Learning
es: Comenzar
fr: Commencer
hi: शुरू करें
zh: 开始使用

# startWritingHere
source: Begin your practice here...
es: Empieza a escribir aquí...
fr: Commencez à écrire ici...
hi: यहाँ लिखना शुरू करें...
zh: 在此开始写作...

source: Report Content
es: Reportar Contenido
fr: Signaler le Contenu
hi: सामग्री रिपोर्ट करें
zh: 报告内容

source: Unsaved Changes
es: Cambios sin guardar
fr: Modifications non enregistrées
hi: असुरक्षित परिवर्तन
zh: 未保存的更改

# saveChangesQuestion
source: Do you want to save your progress?
es: ¿Deseas guardar tus cambios?
fr: Voulez-vous enregistrer vos modifications ?
hi: क्या आप अपने परिवर्तनों को सहेजना चाहते हैं?
zh: 是否要保存更改？

source: Discard
es: Descartar
fr: Abandonner
hi: छोड़ें
zh: 放弃

source: Save
es: Guardar
fr: Enregistrer
hi: सहेजें
zh: 保存

# reportContentIssue
source: Please describe the issue with this content:
es: Por favor describe el problema con este contenido:
fr: Veuillez décrire le problème avec ce contenu :
hi: कृपया इस सामग्री की समस्या का वर्णन करें:
zh: 请描述此内容的问题：

# enterConcern
source: Enter your concern...
es: Ingresa tu preocupación...
fr: Entrez votre préoccupation...
hi: अपनी चिंता दर्ज करें...
zh: 输入您的问题...

source: Cancel
es: Cancelar
fr: Annuler
hi: रद्द करें
zh: 取消

source: Submit
es: Enviar
fr: Soumettre
hi: जमा करें
zh: 提交

# reportSubmitted
source: Report submitted successfully
es: Reporte enviado exitosamente
fr: Rapport soumis avec succès
hi: रिपोर्ट सफलतापूर्वक जमा की गई
zh: 报告提交成功

# changesSaved
source: Progress saved
es: Cambios guardados
fr: Modifications enregistrées
hi: परिवर्तन सहेजे गए
zh: 更改已保存

source: Initialization Error
es: Error de inicialización
fr: Erreur d'initialisation
hi: प्रारंभिक त्रुटि
zh: 初始化错误

source: Retry
es: Reintentar
fr: Réessayer
hi: पुनः प्रयास करें
zh: 重试

# exportThesis
source: Export Document
es: Exportar Tesis
fr: Exporter la Thèse
hi: थीसिस निर्यात करें
zh: 导出论文

source: Export as PDF
es: Exportar como PDF
fr: Exporter en PDF
hi: PDF के रूप में निर्यात करें
zh: 导出为PDF

# exportDescription
source: Your academic work will be exported as a PDF file and saved to your Downloads folder.
es: Tu tesis será exportada como archivo PDF y guardada en tu carpeta de Descargas.
fr: Votre thèse sera exportée au format PDF et enregistrée dans votre dossier Téléchargements.
hi: आपकी थीसिस PDF फ़ाइल के रूप में निर्यात की जाएगी और डाउनलोड फ़ोल्डर में सहेजी जाएगी।
zh: 您的论文将以PDF格式导出并保存到下载文件夹。

# pdfSavedToDownloads
source: PDF saved to Downloads: {path}
es: PDF guardado en Descargas: {path}
fr: PDF enregistré dans Téléchargements : {path}
hi: PDF डाउनलोड में सहेजी गई: {path}
zh: PDF已保存到下载文件夹：{path}

source: OK
hi: ठीक है
zh: 确定

# error
source: Error: {message}
fr: Erreur : {message}
hi: त्रुटि: {message}
zh: 错误：{message}

# thesis
source: Academic Structure
es: Tesis
fr: Thèse
hi: थीसिस
zh: 论文

source: Generate All
es: Generar Todo
fr: Tout Générer
hi: सभी उत्पन्न करें
zh: 生成全部

# pleaseCompleteAllSections
source: Please complete all sections before exporting
es: Por favor completa todas las secciones antes de exportar
fr: Veuillez compléter toutes les sections avant d'exporter
hi: निर्यात करने से पहले कृपया सभी खंड पूरे करें
zh: 导出前请完成所有部分

# generatedSuccessfully
source: Structure created successfully! Click On PDF to export
es: ¡Generado exitosamente! Haz clic en PDF para exportar
fr: Génération réussie ! Cliquez sur PDF pour exporter
hi: सफलतापूर्वक उत्पन्न! निर्यात करने के लिए PDF पर क्लिक करें
zh: 生成成功！点击PDF进行导出

# errorGeneratingContent
source: Error creating content: {error}
es: Error generando contenido: {error}
fr: Erreur lors de la génération du contenu : {error}
hi: सामग्री उत्पन्न करने में त्रुटि: {error}
zh: 生成内容时出错：{error}

# failedToGenerateContent
source: Failed to create content: {error}
es: Error al generar contenido: {error}
fr: Échec de la génération du contenu : {error}
hi: सामग्री उत्पन्न करने में विफल: {error}
zh: 内容生成失败：{error}

# loadingMessage1
source: Preparing your academic structure...
es: Estamos generando la estructura de tu tesis...
fr: Nous générons la structure de votre thèse...
hi: हम आपकी थीसिस संरचना तैयार कर रहे हैं...
zh: 正在生成论文结构...

# loadingMessage2
source: Organizing your learning materials...
es: Este proceso toma entre 4-7 minutos...
fr: Ce processus prend environ 4-7 minutes...
hi: इस प्रक्रिया में लगभग 4-7 मिनट लगते हैं...
zh: 此过程需要约4-7分钟...

# loadingMessage3
source: Building your academic framework...
es: Creando tu viaje académico...
fr: Création de votre parcours académique...
hi: आपकी शैक्षणिक यात्रा को आकार दे रहे हैं...
zh: 正在规划您的学术旅程...

# loadingMessage4
source: Structuring your research outline...
es: Organizando tu marco de investigación...
fr: Organisation de votre cadre de recherche...
hi: आपके शोध ढांचे को व्यवस्थित कर रहे हैं...
zh: 正在组织研究框架...

# loadingMessage5
source: Creating your learning foundation...
es: Construyendo una base sólida para tu tesis...
fr: Construction d'une base solide pour votre thèse...
hi: आपकी थीसिस के लिए एक मजबूत आधार बना रहे हैं...
zh: 正在为您的论文建立坚实基础...

# loadingMessage6
source: Almost there, finalizing your structure...
es: Casi listo, finalizando tu esquema...
fr: Presque terminé, finalisation de votre plan...
hi: बस थोड़ी देर और, आपकी रूपरेखा को अंतिम रूप दे रहे हैं...
zh: 即将完成，正在最终确定大纲...

# createThesis
source: Create Structure
es: Crear Tesis
fr: Créer une Thèse
hi: थीसिस बनाएं
zh: 创建论文

# thesisTopic
source: Research Topic
es: Tema de Tesis
fr: Sujet de Thèse
hi: थीसिस विषय
zh: 论文主题

# enterThesisTopic
source: Enter your research topic
es: Ingresa el tema de tu tesis
fr: Entrez votre sujet de thèse
hi: अपना थीसिस विषय दर्ज करें
zh: 输入论文主题

# pleaseEnterTopic
source: Please enter a topic
es: Por favor ingresa un tema
fr: Veuillez entrer un sujet
hi: कृपया एक विषय दर्ज करें
zh: 请输入主题

# generateChapters
source: Create Sections
es: Generar Capítulos
fr: Générer les Chapitres
hi: अध्याय उत्पन्न करें
zh: 生成章节

# generatedChapters
source: Created Sections
es: Capítulos Generados
fr: Chapitres Générés
hi: उत्पन्न अध्याय
zh: 已生成的章节

# chapter
source: Section {number}
es: Capítulo {number}
fr: Chapitre {number}
hi: अध्याय {number}
zh: 第{number}章

# pleaseEnterChapterTitle
source: Please enter section title
es: Por favor ingresa el título del capítulo
fr: Veuillez entrer le titre du chapitre
hi: कृपया अध्याय का शीर्षक दर्ज करें
zh: 请输入章节标题

# writingStyle
source: Academic Style
es: Estilo de Escritura
fr: Style d'Écriture
hi: लेखन शैली
zh: 写作风格

source: Format
es: Formato
hi: प्रारूप
zh: 格式

# generateThesis
source: Create Structure
es: Generar Tesis
fr: Générer la Thèse
hi: थीसिस उत्पन्न करें
zh: 生成论文

# pleaseEnterThesisTopicFirst
source: Please enter a research topic first
es: Por favor ingresa primero el tema de la tesis
fr: Veuillez d'abord entrer un sujet de thèse
hi: कृपया पहले थीसिस विषय दर्ज करें
zh: 请先输入论文主题

# failedToGenerateChapters
source: Failed to create sections: {error}
es: Error al generar capítulos: {error}
fr: Échec de la génération des chapitres : {error}
hi: अध्याय उत्पन्न करने में विफल: {error}
zh: 生成章节失败：{error}

# errorGeneratingThesis
source: Error creating structure: {error}
es: Error al generar tesis: {error}
fr: Erreur lors de la génération de la thèse : {error}
hi: थीसिस उत्पन्न करने में त्रुटि: {error}
zh: 生成论文时出错：{error}

# generatingContent
source: Creating content...
es: Generando contenido...
fr: Génération du contenu...
hi: सामग्री उत्पन्न हो रही है...
zh: 正在生成内容...

# pleaseCompleteAllChapters
source: Please complete all section titles
es: Por favor completa todos los títulos de los capítulos
fr: Veuillez compléter tous les titres des chapitres
hi: कृपया सभी अध्यायों के शीर्षक पूरे करें
zh: 请完成所有章节标题

# requiredChaptersMissing
source: Introduction and Conclusion sections are required
es: Los capítulos de Introducción y Conclusión son requeridos
fr: Les chapitres Introduction et Conclusion sont requis
hi: परिचय और निष्कर्ष अध्याय आवश्यक हैं
zh: 引言和结论章节为必需章节

source: Open File
es: Abrir Archivo
fr: Ouvrir le Fichier
hi: फ़ाइल खोलें
zh: 打开文件

# errorGeneratingOutlines
source: Error Creating Outline
es: Error al Generar Esquemas
fr: Erreur lors de la Génération des Plans
hi: रूपरेखा उत्पन्न करने में त्रुटि
zh: 生成大纲时出错

source: Edit
es: Editar
fr: Modifier
hi: संपादित करें
zh: 编辑

source: Add Text
es: Agregar Texto
fr: Ajouter du Texte
hi: टेक्स्ट जोड़ें
zh: 添加文本

source: Highlight
es: Resaltar
fr: Surligner
hi: हाइलाइट करें
zh: 高亮

source: Delete
es: Eliminar
fr: Supprimer
hi: हटाएं
zh: 删除

source: Save PDF
es: Guardar PDF
fr: Enregistrer le PDF
hi: PDF सहेजें
zh: 保存PDF

source: Share
es: Compartir
fr: Partager
hi: साझा करें
zh: 分享

# thesisOutline
source: Academic Outline
es: Esquema de Tesis
fr: Plan de Thèse
hi: थीसिस रूपरेखा
zh: 论文大纲
